meeting/agenda/2024/02-13.org
:PROPERTIES:
:ID:       01798703-6BFD-45F5-B243-E47CF4660537
:END:
#+title: QT4 CG Meeting 065 Agenda 2024-02-13
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

[[../][Agenda index]] / [[https://qt4cg.org][QT4CG.org]] / [[https://qt4cg.org/dashboard][Dashboard]] / [[https://github.com/qt4cg/qtspecs/issues][GH Issues]] / [[https://github.com/qt4cg/qtspecs/pulls][GH Pull Requests]]

* Agenda
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: agenda
:END:

This meeting will be hosted on Zoom at 16:00BST (17:00CEST, 11:00EDT, 08:00PDT).

See the [[https://qt4cg.org/meeting/logistics.html][meeting logistics]] page for details.

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

** Approve the agenda
:PROPERTIES:
:CUSTOM_ID: accept-agenda
:END:

** Approve minutes of previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Minutes of [[../../minutes/2024/02-06.html][the previous meeting]].

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

This meeting is planned for 13 February. The following meeting is
scheduled for 20 February.

Any regrets for 20 February 2024?

** Review of open action items [3/18]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

(Items marked [X] are believed to have been closed via email before
this agenda was posted.)

+ [ ] QT4CG-052-02: NW to consider how to schedule an “editor’s meeting”
+ [ ] QT4CG-056-04: MK to write a proposal for adding a select attribute to xsl:text
+ [ ] QT4CG-058-02: MK to consider providing more advice about the pitfalls of mixing decimal and double when sorting
+ [X] QT4CG-062-03: JK to revise the fn:hash function along the lines discussed at the meeting
+ [ ] QT4CG-063-01: MK to revise #956 especially with respect to the options parameter
+ [ ] QT4CG-063-02: JK to consider whether the roman numeral example is appropriate for the spec.
+ [X] QT4CG-063-03: DN to address the editorial remarks from meeting 063 in a new PR.
+ [ ] QT4CG-063-04: NW to try to add test review to the editorial meeting.
+ [ ] QT4CG-063-05: MK to revise PR #953 to take account of CG’s comments
+ [ ] QT4CG-063-06: MK to consider refactoring the declare item type syntax to something like declare record
+ [X] QT4CG-064-01: MK to remove “#…” and “#x…” arguments from ~fn:char~
+ [ ] QT4CG-064-02: CG to update the fallback function to use the new ~char~ argument.
+ [ ] QT4CG-064-03: CG to add examples to show how JSON parsing changes are useful.
+ [ ] QT4CG-064-04: CG to change the return type of ~fallback~ to ~xs:untypedAtomic?~
+ [ ] QT4CG-064-05: CG to amend the names in the keys-where example to be more inclusive
+ [ ] QT4CG-064-06: Add a ~keys-where~ example that uses the value in a more interesting way.
+ [ ] QT4CG-064-07: CG to add an ~array:index-of~ example that uses a collation
+ [ ] QT4CG-064-08: NW to open an issue to try to resolve $search to $target consistently.

** Review of open pull requests and issues
:PROPERTIES:
:CUSTOM_ID: open-pull-requests
:END:

*** Blocked
:PROPERTIES:
:CUSTOM_ID: blocked
:END:

The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.

+ PR [[https://qt4cg.org/dashboard/#pr-956][#956]]: 850-partial Editorial improvements to parse-html()
+ PR [[https://qt4cg.org/dashboard/#pr-529][#529]]: 528 fn:elements-to-maps

*** Merge without discussion
:PROPERTIES:
:CUSTOM_ID: merge-without-discussion
:END:

The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.

+ PR [[https://qt4cg.org/dashboard/#pr-1010][#1010]]: 1009 Examples, Return type of parse-json:fallback

*** Close without action
:PROPERTIES:
:CUSTOM_ID: close-without-action
:END:

It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/994][#994]]: Invoking maps & arrays: allow sequences?
+ Issue [[https://github.com/qt4cg/qtspecs/issues/989][#989]]: character sequence constructor 'a' to 'z'
+ Issue [[https://github.com/qt4cg/qtspecs/issues/79][#79]]: fn:deep-normalize-space($e as node())
+ Issue [[https://github.com/qt4cg/qtspecs/issues/55][#55]]: Provide an XML version of the stack trace
+ Issue [[https://github.com/qt4cg/qtspecs/issues/42][#42]]: Relax type incompatibility in order by clause (impl. dep. instead of XPST0004)

*** XSLT focused
:PROPERTIES:
:CUSTOM_ID: xslt-focused
:END:

The following PRs appear to be candidates for a future XSLT-focused
meeting.

+ PR [[https://qt4cg.org/dashboard/#pr-921][#921]]: 920 Allow xsl:break and xsl:next-iteration within branch of xsl:switch
+ PR [[https://qt4cg.org/dashboard/#pr-871][#871]]: Action qt4 cg 027 01 next match

These issues identify the XSLT-focused changes that have been made to
the specifications but which have not been established by the
community group as the status quo.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/168][#168]]: XSLT Extension Instructions invoking Named Templates

*** Substantive PRs
:PROPERTIES:
:CUSTOM_ID: substantive
:END:

The following substantive PRs were open when this agenda was prepared.

+ PR [[https://qt4cg.org/dashboard/#pr-1015][#1015]]: 1013 [XSLT] Clarify effect of accumulator capture on non-element nodes
+ PR [[https://qt4cg.org/dashboard/#pr-1008][#1008]]: 1002 Add fn:take-while function (replacing subsequence-before)
+ PR [[https://qt4cg.org/dashboard/#pr-1003][#1003]]: 919 Use EBV in boolean callbacks
+ PR [[https://qt4cg.org/dashboard/#pr-988][#988]]: 960 Pinned and labeled values
+ PR [[https://qt4cg.org/dashboard/#pr-985][#985]]: 720 Add lookup arrow expressions (method invocations)
+ PR [[https://qt4cg.org/dashboard/#pr-978][#978]]: 948 Reflected the comments of the CG on the specification of scan-left and scan-right
+ PR [[https://qt4cg.org/dashboard/#pr-972][#972]]: 949 Partial Function Applications: Allow return of function name
+ PR [[https://qt4cg.org/dashboard/#pr-953][#953]]: 617 Define record constructors
+ PR [[https://qt4cg.org/dashboard/#pr-916][#916]]: 720 Allow methods in maps with access to $this
+ PR [[https://qt4cg.org/dashboard/#pr-832][#832]]: 77 Add map:deep-update and array:deep-update
+ PR [[https://qt4cg.org/dashboard/#pr-795][#795]]: 655 fn:sort-with

*** Proposed for V4.0
:PROPERTIES:
:CUSTOM_ID: proposed-40
:END:

The following issues are labled “proposed for V4.0”.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/938][#938]]: Canonical serialization
+ Issue [[https://github.com/qt4cg/qtspecs/issues/910][#910]]: Introduce a Kollection object with functions that operate on all types of items that can be containers of unlimited number of "members"
+ Issue [[https://github.com/qt4cg/qtspecs/issues/908][#908]]: Function identity: documentation still too vague
+ Issue [[https://github.com/qt4cg/qtspecs/issues/882][#882]]: fn:chain or fn:compose
+ Issue [[https://github.com/qt4cg/qtspecs/issues/850][#850]]: fn:parse-html: Finalization
+ Issue [[https://github.com/qt4cg/qtspecs/issues/829][#829]]: fn:boolean: EBV support for more item types
+ Issue [[https://github.com/qt4cg/qtspecs/issues/716][#716]]: Generators in XPath
+ Issue [[https://github.com/qt4cg/qtspecs/issues/689][#689]]: fn:stack-trace: keep, drop, replace with $err:stack-trace ?
+ Issue [[https://github.com/qt4cg/qtspecs/issues/583][#583]]: array:replace(), etc
+ Issue [[https://github.com/qt4cg/qtspecs/issues/557][#557]]: fn:unparsed-binary: accessing and manipulating binary types
+ Issue [[https://github.com/qt4cg/qtspecs/issues/340][#340]]: fn:format-number: Specifying decimal format
+ Issue [[https://github.com/qt4cg/qtspecs/issues/283][#283]]: Enumeration types
+ Issue [[https://github.com/qt4cg/qtspecs/issues/236][#236]]: map:build: sequence of keys
+ Issue [[https://github.com/qt4cg/qtspecs/issues/33][#33]]: JSON Parsing & Serialization: Numbers
+ Issue [[https://github.com/qt4cg/qtspecs/issues/31][#31]]: Extend FLWOR expressions to maps

* Technical Agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

As agreed, we continue with the items left over from last week.

** PR #795: 655 fn:sort-with
:PROPERTIES:
:CUSTOM_ID: pr-795
:END:
See PR [[https://qt4cg.org/dashboard/#pr-795][#795]]

T.B.D. Was there progress over the week or is more discussion required?

** PR #972: 949 Partial Function Applications: Allow return of function name
:PROPERTIES:
:CUSTOM_ID: pr-972
:END:
See PR [[https://qt4cg.org/dashboard/#pr-972][#972]]

** PR #988: 960 Pinned and labeled values
:PROPERTIES:
:CUSTOM_ID: pr-988
:END:
See PR [[https://qt4cg.org/dashboard/#pr-988][#988]]

** PR #985: 720 Add lookup arrow expressions (method invocations)
:PROPERTIES:
:CUSTOM_ID: pr-985
:END:
See PR [[https://qt4cg.org/dashboard/#pr-985][#985]]

** PR #978: 948 Reflected the comments of the CG on the specification of scan-left and scan-right
:PROPERTIES:
:CUSTOM_ID: pr-978
:END:
See PR [[https://qt4cg.org/dashboard/#pr-978][#978]]

** PR #953: 617 Define record constructors
:PROPERTIES:
:CUSTOM_ID: pr-953
:END:
See PR [[https://qt4cg.org/dashboard/#pr-953][#953]]

** PR #916: 720 Allow methods in maps with access to $this
:PROPERTIES:
:CUSTOM_ID: pr-916
:END:
See PR [[https://qt4cg.org/dashboard/#pr-916][#916]]

** PR #832: 77 Add map:deep-update and array:deep-update
:PROPERTIES:
:CUSTOM_ID: pr-832
:END:
See PR [[https://qt4cg.org/dashboard/#pr-832][#832]]

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:
