meeting/agenda/2024/02-13.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 065 Agenda 2024-02-13</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 065 Agenda 2024-02-13</h1>
<p>
<a href="../">Agenda index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>

<div id="outline-container-agenda" class="outline-2">
<h2 id="agenda">Agenda</h2>
<div class="outline-text-2" id="text-agenda">
<p>
This meeting will be hosted on Zoom at 16:00BST (17:00CEST, 11:00EDT, 08:00PDT).
</p>

<p>
See the <a href="https://qt4cg.org/meeting/logistics.html">meeting logistics</a> page for details.
</p>
</div>
</div>

<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>

<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call</h3>
<div class="outline-text-3" id="text-roll-call">
</div>
</div>

<div id="outline-container-accept-agenda" class="outline-3">
<h3 id="accept-agenda"><span class="section-number-3">1.2.</span> Approve the agenda</h3>
<div class="outline-text-3" id="text-accept-agenda">
</div>
</div>

<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Minutes of <a href="../../minutes/2024/02-06.html">the previous meeting</a>.
</p>
</div>
</div>

<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
This meeting is planned for 13 February. The following meeting is
scheduled for 20 February.
</p>

<p>
Any regrets for 20 February 2024?
</p>
</div>
</div>

<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[3/18]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<p>
(Items marked [X] are believed to have been closed via email before
this agenda was posted.)
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-052-02: NW to consider how to schedule an “editor’s meeting”</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-056-04: MK to write a proposal for adding a select attribute to xsl:text</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-058-02: MK to consider providing more advice about the pitfalls of mixing decimal and double when sorting</li>
<li class="on"><code>[X]</code> QT4CG-062-03: JK to revise the fn:hash function along the lines discussed at the meeting</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-063-01: MK to revise #956 especially with respect to the options parameter</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-063-02: JK to consider whether the roman numeral example is appropriate for the spec.</li>
<li class="on"><code>[X]</code> QT4CG-063-03: DN to address the editorial remarks from meeting 063 in a new PR.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-063-04: NW to try to add test review to the editorial meeting.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-063-05: MK to revise PR #953 to take account of CG’s comments</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-063-06: MK to consider refactoring the declare item type syntax to something like declare record</li>
<li class="on"><code>[X]</code> QT4CG-064-01: MK to remove “#…” and “#x…” arguments from <code>fn:char</code></li>
<li class="off"><code>[&#xa0;]</code> QT4CG-064-02: CG to update the fallback function to use the new <code>char</code> argument.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-064-03: CG to add examples to show how JSON parsing changes are useful.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-064-04: CG to change the return type of <code>fallback</code> to <code>xs:untypedAtomic?</code></li>
<li class="off"><code>[&#xa0;]</code> QT4CG-064-05: CG to amend the names in the keys-where example to be more inclusive</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-064-06: Add a <code>keys-where</code> example that uses the value in a more interesting way.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-064-07: CG to add an <code>array:index-of</code> example that uses a collation</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-064-08: NW to open an issue to try to resolve $search to $target consistently.</li>
</ul>
</div>
</div>

<div id="outline-container-open-pull-requests" class="outline-3">
<h3 id="open-pull-requests"><span class="section-number-3">1.6.</span> Review of open pull requests and issues</h3>
<div class="outline-text-3" id="text-open-pull-requests">
</div>

<div id="outline-container-blocked" class="outline-4">
<h4 id="blocked"><span class="section-number-4">1.6.1.</span> Blocked</h4>
<div class="outline-text-4" id="text-blocked">
<p>
The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-956">#956</a>: 850-partial Editorial improvements to parse-html()</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-529">#529</a>: 528 fn:elements-to-maps</li>
</ul>
</div>
</div>

<div id="outline-container-merge-without-discussion" class="outline-4">
<h4 id="merge-without-discussion"><span class="section-number-4">1.6.2.</span> Merge without discussion</h4>
<div class="outline-text-4" id="text-merge-without-discussion">
<p>
The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1010">#1010</a>: 1009 Examples, Return type of parse-json:fallback</li>
</ul>
</div>
</div>

<div id="outline-container-close-without-action" class="outline-4">
<h4 id="close-without-action"><span class="section-number-4">1.6.3.</span> Close without action</h4>
<div class="outline-text-4" id="text-close-without-action">
<p>
It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/994">#994</a>: Invoking maps &amp; arrays: allow sequences?</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/989">#989</a>: character sequence constructor 'a' to 'z'</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/79">#79</a>: fn:deep-normalize-space($e as node())</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/55">#55</a>: Provide an XML version of the stack trace</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/42">#42</a>: Relax type incompatibility in order by clause (impl. dep. instead of XPST0004)</li>
</ul>
</div>
</div>

<div id="outline-container-xslt-focused" class="outline-4">
<h4 id="xslt-focused"><span class="section-number-4">1.6.4.</span> XSLT focused</h4>
<div class="outline-text-4" id="text-xslt-focused">
<p>
The following PRs appear to be candidates for a future XSLT-focused
meeting.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-921">#921</a>: 920 Allow xsl:break and xsl:next-iteration within branch of xsl:switch</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-871">#871</a>: Action qt4 cg 027 01 next match</li>
</ul>

<p>
These issues identify the XSLT-focused changes that have been made to
the specifications but which have not been established by the
community group as the status quo.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/168">#168</a>: XSLT Extension Instructions invoking Named Templates</li>
</ul>
</div>
</div>

<div id="outline-container-substantive" class="outline-4">
<h4 id="substantive"><span class="section-number-4">1.6.5.</span> Substantive PRs</h4>
<div class="outline-text-4" id="text-substantive">
<p>
The following substantive PRs were open when this agenda was prepared.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1015">#1015</a>: 1013 [XSLT] Clarify effect of accumulator capture on non-element nodes</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1008">#1008</a>: 1002 Add fn:take-while function (replacing subsequence-before)</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1003">#1003</a>: 919 Use EBV in boolean callbacks</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-988">#988</a>: 960 Pinned and labeled values</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-985">#985</a>: 720 Add lookup arrow expressions (method invocations)</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-978">#978</a>: 948 Reflected the comments of the CG on the specification of scan-left and scan-right</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-972">#972</a>: 949 Partial Function Applications: Allow return of function name</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-953">#953</a>: 617 Define record constructors</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-916">#916</a>: 720 Allow methods in maps with access to $this</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-832">#832</a>: 77 Add map:deep-update and array:deep-update</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-795">#795</a>: 655 fn:sort-with</li>
</ul>
</div>
</div>

<div id="outline-container-proposed-40" class="outline-4">
<h4 id="proposed-40"><span class="section-number-4">1.6.6.</span> Proposed for V4.0</h4>
<div class="outline-text-4" id="text-proposed-40">
<p>
The following issues are labled “proposed for V4.0”.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/938">#938</a>: Canonical serialization</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/910">#910</a>: Introduce a Kollection object with functions that operate on all types of items that can be containers of unlimited number of "members"</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/908">#908</a>: Function identity: documentation still too vague</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/882">#882</a>: fn:chain or fn:compose</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/850">#850</a>: fn:parse-html: Finalization</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/829">#829</a>: fn:boolean: EBV support for more item types</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/716">#716</a>: Generators in XPath</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/689">#689</a>: fn:stack-trace: keep, drop, replace with $err:stack-trace ?</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/583">#583</a>: array:replace(), etc</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/557">#557</a>: fn:unparsed-binary: accessing and manipulating binary types</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/340">#340</a>: fn:format-number: Specifying decimal format</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/283">#283</a>: Enumeration types</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/236">#236</a>: map:build: sequence of keys</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/33">#33</a>: JSON Parsing &amp; Serialization: Numbers</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/31">#31</a>: Extend FLWOR expressions to maps</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical Agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
<p>
As agreed, we continue with the items left over from last week.
</p>
</div>

<div id="outline-container-pr-795" class="outline-3">
<h3 id="pr-795"><span class="section-number-3">2.1.</span> PR #795: 655 fn:sort-with</h3>
<div class="outline-text-3" id="text-pr-795">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-795">#795</a>
</p>

<p>
T.B.D. Was there progress over the week or is more discussion required?
</p>
</div>
</div>

<div id="outline-container-pr-972" class="outline-3">
<h3 id="pr-972"><span class="section-number-3">2.2.</span> PR #972: 949 Partial Function Applications: Allow return of function name</h3>
<div class="outline-text-3" id="text-pr-972">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-972">#972</a>
</p>
</div>
</div>

<div id="outline-container-pr-988" class="outline-3">
<h3 id="pr-988"><span class="section-number-3">2.3.</span> PR #988: 960 Pinned and labeled values</h3>
<div class="outline-text-3" id="text-pr-988">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-988">#988</a>
</p>
</div>
</div>

<div id="outline-container-pr-985" class="outline-3">
<h3 id="pr-985"><span class="section-number-3">2.4.</span> PR #985: 720 Add lookup arrow expressions (method invocations)</h3>
<div class="outline-text-3" id="text-pr-985">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-985">#985</a>
</p>
</div>
</div>

<div id="outline-container-pr-978" class="outline-3">
<h3 id="pr-978"><span class="section-number-3">2.5.</span> PR #978: 948 Reflected the comments of the CG on the specification of scan-left and scan-right</h3>
<div class="outline-text-3" id="text-pr-978">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-978">#978</a>
</p>
</div>
</div>

<div id="outline-container-pr-953" class="outline-3">
<h3 id="pr-953"><span class="section-number-3">2.6.</span> PR #953: 617 Define record constructors</h3>
<div class="outline-text-3" id="text-pr-953">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-953">#953</a>
</p>
</div>
</div>

<div id="outline-container-pr-916" class="outline-3">
<h3 id="pr-916"><span class="section-number-3">2.7.</span> PR #916: 720 Allow methods in maps with access to $this</h3>
<div class="outline-text-3" id="text-pr-916">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-916">#916</a>
</p>
</div>
</div>

<div id="outline-container-pr-832" class="outline-3">
<h3 id="pr-832"><span class="section-number-3">2.8.</span> PR #832: 77 Add map:deep-update and array:deep-update</h3>
<div class="outline-text-3" id="text-pr-832">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-832">#832</a>
</p>
</div>
</div>
</div>

<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
</div>
</div>
</div>
</body>
</html>